#include <stdio.h>
#include <math.h>

int main() {
    // Оголошення та ініціалізація змінної 'value'
    int value = 1; // 'printf' - змінна для форматованого виводу
    value = value + 1; // Оновлення значення змінної 'value'. Тепер 'value' дорівнює 2.

    // Оголошення та ініціалізація змінних типу float та double
    float f = 2.0f; // 'f' - змінна типу float з початковим значенням 2.0
    double d = 3.0; // 'd' - змінна типу double з початковим значенням 3.0
    double d1 = 2.0; // 'd1' - змінна типу double з початковим значенням 2.0

    // Оголошення змінної 'valTest' типу int
    int valTest = 12345;

    // Оголошення змінної 'c' типу char
    char c = 's'; // 'c' - змінна типу char з початковим значенням 's'
    
    c = valTest; // Присвоєння значення 'valTest' змінній 'c'. Буде збережено лише младше 1 байта значення.

    // Обчислення квадратного кореня з 36
    double outSQRT = sqrt(36); // 'outSQRT' - змінна типу double, яка міститиме результат sqrt(36), тобто 6.0

    // Вивід даних на консоль за допомогою 'printf'
    printf("Hello, World %d\n", value); // Виведе значення змінної 'value' (2) з текстом "Hello, World"
    printf("Hello, World %f\n", f); // Виведе значення змінної 'f' (2.0) з текстом "Hello, World"
    //printf("Hello, World %f\n", dOut); // Закоментоване, оскільки 'dOut' не визначена
    
    // Вивід символу, збереженого в 'c'
    printf("our char: %c\n", c); // Виведе символ, збережений у 'c', що може бути непередбачуваним значенням

    // Оголошення змінної 'char_test' типу int
    int char_test;

    // Оголошення змінної 'cTest2' типу char
    char cTest2;
    // int b = (cTest2 = getchar()); // Закоментовано, але ця стрічка читає символ з вводу та перетворює його в int

    // Умова для виводу повідомлення
    if (value > 2) { 
        printf("Hello, World!\n"); // Виведе це повідомлення, якщо 'value' більше 2
    } else {
        printf("Hello, Students!\n"); // Виведе це повідомлення, якщо 'value' менше або дорівнює 2
    }

    // Блок коду, який читає символи з вводу до EOF
    // for (; (cTest2 = getchar()) != EOF;) { // Блокування вводу до натискання Ctrl + C
    //     printf("%c", cTest2); // Виводить кожен символ, прочитаний з вводу
    // }
    // printf("%d", cTest2); // Виведе числове значення змінної 'cTest2'

    // Закоментовані приклади використання 'printf' без форматного рядка
    // printf("Hello, World 1", value); // Неправильний виклик, форматний рядок відсутній

    // Додаткові коментарі про функцію 'printf'
    // printf -> форматований вивід на екран
    // "Hello, World" - стандартне повідомлення

    return 0; // Завершення програми
}
